{
  "id": "toast-06-11-19",
  "date": "2019-11-06",
  "image": "https://epic.weeb.services/1247d7bb1f.png",
  "contents": [
    {
      "type": "HEADER",
      "color": "GREEN",
      "text": "Improved Toaster",
      "noMargin": true
    },
    {
      "type": "CONTENTS",
      "text": "Powercord will now bake better toasts, with pre-applied butter or whatever you like to put on them.",
      "list": [
        "**100% more cute**, because Harley did a good job.",
        "**They are now part of the public plugin API** meaning you can make use of them in your plugins. Isn't that nice?",
        "**Announcements are also part of the public API**, so if you want to send them you can!"
      ]
    },
    {
      "type": "HEADER",
      "color": "RED",
      "text": "Have a red category"
    },
    {
      "type": "CONTENTS",
      "text": "Just wanted a second red category, because red is a cool color."
    },
    {
      "type": "HEADER",
      "color": "ORANGE",
      "text": "More cool stuff"
    },
    {
      "type": "CONTENTS",
      "list": [
        "**Updater got some tweaking** to help it not explode while updating. I thought it's be cool.",
        "**Removed a spoiler** because spoilers are bad. I'm sure no one noticed it was here. And if you did, you saw nothing ok?",
        "**Added a spoiler** because spoilers are cool. I'm sure you'll like it. It's about a wanted feature. That is cool.",
        "**First install banner**'s \"Join Server\" button will now **open an invite prompt first**, instead of immediately dropping you into the server.",
        "**Documentation is coming soon**, and most of the work client-side is done :zoomeyes:. We just need to write them now... Seeya in a few years! <3 After all, what is 10 years on the scale of the universe? Nothing right?",
        "**Custom Route API** is here, which lets plugins register new React routes for more complex UIs. It is still experimental and subject to breaking changes.",
        "**Backend API v2 is being worked on**, which will ship a lot of features that'll be then used in Powercord (like plugin installer OwO whats this).",
        "Various tweaking and fixing to make Powercord overall more stable.",
        "Increased emma's cuteness."
      ]
    }
  ],
  "footer": "Donate for #TeamTrees at <a href='https://teamtrees.org' target='_blank'>teamtrees.org</a>."
}
